Autodesk.Revit.DB.AdaptiveComponentInstanceUtils.SetInstanceFlipped(Autodesk.Revit.DB.FamilyInstance,System.Boolean)
Sets the value of the flip parameter on the adaptive instance.
famInst:
The FamilyInstance
flip:
The flip flag
Throws Autodesk.Revit.Exceptions.ArgumentException:
The FamilyInstance famInst is not an Adaptive Family Instance.
-or-
The FamilyInstance famInst does not have an Adaptive Family Symbol.
-or-
The FamilyInstance famInst cannot be flipped or unflipped.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation failed.
Since:
2012

Autodesk.Revit.DB.AdaptiveComponentInstanceUtils.IsInstanceFlipped(Autodesk.Revit.DB.FamilyInstance)
Gets the value of the flip parameter on the adaptive instance.
famInst:
The FamilyInstance
Returns:
True if the instance is flipped.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The FamilyInstance famInst is not an Adaptive Family Instance.
-or-
The FamilyInstance famInst does not have an Adaptive Family Symbol.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.AdaptiveComponentInstanceUtils.GetInstanceShapeHandlePointElementRefIds(Autodesk.Revit.DB.FamilyInstance)
Gets Shape Handle Adaptive Point Element Ref ids to which the instance geometry adapts.
Remarks:
The output contains shape handle point ref ids.
If there are no shape handle points defined in the Family then the output
is empty.
famInst:
The FamilyInstance
Returns:
The Shape Handle Adaptive Point Element Ref ids to which the instance geometry adapts.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The FamilyInstance famInst is not an Adaptive Family Instance.
-or-
The FamilyInstance famInst does not have an Adaptive Family Symbol.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation failed.
Since:
2012

Autodesk.Revit.DB.AdaptiveComponentInstanceUtils.GetInstancePlacementPointElementRefIds(Autodesk.Revit.DB.FamilyInstance)
Gets Placement Adaptive Point Element Ref ids to which the instance geometry adapts.
Remarks:
The output contains placement point ref ids. The element ids are sorted in
by the placement numbers (increasing order).
famInst:
The FamilyInstance.
Returns:
The Placement Adaptive Point Element Ref ids to which the instance geometry adapts.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The FamilyInstance famInst is not an Adaptive Family Instance.
-or-
The FamilyInstance famInst does not have an Adaptive Family Symbol.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation failed.
Since:
2012

Autodesk.Revit.DB.AdaptiveComponentInstanceUtils.GetInstancePointElementRefIds(Autodesk.Revit.DB.FamilyInstance)
Gets Adaptive Point Element Ref ids to which the instance geometry adapts.
Remarks:
The output contains both placement point ref ids and the shape handles
point ref ids. The order corresponds to the same order as that
of the Adaptive Points in the Family (which may not be ordered as per
their placement number).
Will return an empty array if there are no placement points and shape
handles. To manipulate such an instance the following methods can be
useful:
1) RehostAdaptiveComponentInstanceWithNoPlacementPoints()
2) MoveAdaptiveComponentInstance()
famInst:
The FamilyInstance.
Returns:
The Adaptive Point Element Ref ids to which the instance geometry adapts.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The FamilyInstance famInst is not an Adaptive Family Instance.
-or-
The FamilyInstance famInst does not have an Adaptive Family Symbol.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation failed.
Since:
2012

Autodesk.Revit.DB.AdaptiveComponentInstanceUtils.MoveAdaptiveComponentInstance(Autodesk.Revit.DB.FamilyInstance,Autodesk.Revit.DB.Transform,System.Boolean)
Moves Adaptive Component Instance by the specified transformation.
Remarks:
This method will attempt a rigid body motion of all the individual references and hence
the instance itself. However if unHost parameter is 'false' and any of the instance's
references are hosted to any geometry, then those references will move within the constraints.
The instance then adapts to where its references are moved to.
famInst:
The FamilyInstance
trf:
The Transformation
unHost:
True if the move should disassociate the Point Element Refs from their hosts.
False if the Point Element Refs remain hosted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
trf is not a rigid body transformation.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Unable to move the adaptive component instance.
Since:
2012

Autodesk.Revit.DB.AdaptiveComponentInstanceUtils.CreateAdaptiveComponentInstance(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FamilySymbol)
Creates a FamilyInstance of Adaptive Component Family.
Remarks:
This method creates an Adaptive FamilyInstance and its PointElement references.
The references can be accessed by methods like GetInstancePointElementRefIds().
The PointElement references can be moved, rehosted or manipulated just like any
other PointElements. The FamilyInstance would then 'adapt' to these references.
doc:
The Document
famSymb:
The FamilySymbol
Returns:
The Family Instance
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element famSymb was not found in the given document.
-or-
The Symbol famSymb is not an Adaptive Family Symbol.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Unable to create adaptive component instance.
Since:
2012

Autodesk.Revit.DB.AdaptiveComponentInstanceUtils.IsAdaptiveComponentInstance(Autodesk.Revit.DB.FamilyInstance)
Verifies if a FamilyInstance is an Adaptive Component Instance.
famInst:
The FamilyInstance
Returns:
True if the FamilyInstance has an Adaptive Component Instances.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.AdaptiveComponentInstanceUtils.HasAdaptiveFamilySymbol(Autodesk.Revit.DB.FamilyInstance)
Verifies if a FamilyInstance has an Adaptive Family Symbol.
famInst:
The FamilyInstance
Returns:
True if the FamilyInstance has an Adaptive Family Symbol.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.AdaptiveComponentInstanceUtils.IsAdaptiveFamilySymbol(Autodesk.Revit.DB.FamilySymbol)
Verifies if a FamilySymbol is a valid Adaptive Family Symbol.
famSymb:
The FamilySymbol
Returns:
True if the FamilySymbol is a valid Adaptive Family Symbol.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.AdaptiveComponentInstanceUtils
An interface for Adaptive Component Instances.
Since:
2012